; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v4 - type_1 ?v7 - type_3)
 	      (pred_2 ?v8 - object ?v7 - type_3)
	      (pred_1 ?v4 - type_1 ?v6 - type_2)
	      (pred_3 ?v4 - type_1 ?v8 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v4 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_4 ?v4 ?v5))
       :effect (and  (pred_4 ?v4 ?v2)
		     (not (pred_4 ?v4 ?v5))))

   (:action op_1
       :parameters (?v4 - type_1 ?v3 - object ?v1 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v1) (pred_4 ?v4 ?v1) (pred_1 ?v4 ?v6))
       :effect (and (pred_3 ?v4 ?v3 ?v6)
		    (not (pred_2 ?v3 ?v1)) 
		    (not (pred_1 ?v4 ?v6))))

   (:action op_3
       :parameters (?v4 - type_1 ?v3 - object ?v1 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v3 ?v6) (pred_4 ?v4 ?v1))
       :effect (and (pred_2 ?v3 ?v1)
		    (pred_1 ?v4 ?v6)
		    (not (pred_3 ?v4 ?v3 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_14 - type_1
obj_12 obj_11 obj_08 obj_02 - type_2
obj_03 obj_01 obj_06 obj_04 - type_3
obj_05 obj_13 obj_10 obj_09 - object)
(:init
(pred_4 obj_07 obj_04)
(pred_1 obj_07 obj_12)
(pred_1 obj_07 obj_11)
(pred_4 obj_14 obj_01)
(pred_1 obj_14 obj_08)
(pred_1 obj_14 obj_02)
(pred_2 obj_05 obj_01)
(pred_2 obj_13 obj_04)
(pred_2 obj_10 obj_06)
(pred_2 obj_09 obj_04)
)
(:goal
(and
(pred_2 obj_05 obj_03)
(pred_2 obj_13 obj_04)
(pred_2 obj_10 obj_04)
(pred_2 obj_09 obj_01)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_06)))
)
)

; plan
1. (op_1 obj_14 obj_05 obj_01 obj_02)
   deleted: (pred_2 obj_05 obj_01) (pred_1 obj_14 obj_02)
   added: (pred_3 obj_14 obj_05 obj_02)
   goals met: 1 of 4
2. (op_1 obj_07 obj_09 obj_04 obj_11)
   deleted: (pred_2 obj_09 obj_04) (pred_1 obj_07 obj_11)
   added: (pred_3 obj_07 obj_09 obj_11)
   goals met: 1 of 4
3. (op_2 obj_14 obj_01 obj_03)
   deleted: (pred_4 obj_14 obj_01)
   added: (pred_4 obj_14 obj_03)
   goals met: 1 of 4
4. (op_2 obj_07 obj_04 obj_01)
   deleted: (pred_4 obj_07 obj_04)
   added: (pred_4 obj_07 obj_01)
   goals met: 1 of 4
5. (op_3 obj_14 obj_05 obj_03 obj_02)
   deleted: (pred_3 obj_14 obj_05 obj_02)
   added: (pred_2 obj_05 obj_03) (pred_1 obj_14 obj_02)
   goals met: 2 of 4
6. (op_3 obj_07 obj_09 obj_01 obj_11)
   deleted: (pred_3 obj_07 obj_09 obj_11)
   added: (pred_2 obj_09 obj_01) (pred_1 obj_07 obj_11)
   goals met: 3 of 4
7. (op_2 obj_14 obj_03 obj_04)
   deleted: (pred_4 obj_14 obj_03)
   added: (pred_4 obj_14 obj_04)
   goals met: 3 of 4
8. (op_2 obj_07 obj_01 obj_04)
   deleted: (pred_4 obj_07 obj_01)
   added: (pred_4 obj_07 obj_04)
   goals met: 3 of 4
9. (op_2 obj_14 obj_04 obj_06)
   deleted: (pred_4 obj_14 obj_04)
   added: (pred_4 obj_14 obj_06)
   goals met: 3 of 4
10. (op_1 obj_14 obj_10 obj_06 obj_02)
   deleted: (pred_2 obj_10 obj_06) (pred_1 obj_14 obj_02)
   added: (pred_3 obj_14 obj_10 obj_02)
   goals met: 3 of 4
11. (op_2 obj_14 obj_06 obj_04)
   deleted: (pred_4 obj_14 obj_06)
   added: (pred_4 obj_14 obj_04)
   goals met: 3 of 4
12. (op_3 obj_14 obj_10 obj_04 obj_02)
   deleted: (pred_3 obj_14 obj_10 obj_02)
   added: (pred_2 obj_10 obj_04) (pred_1 obj_14 obj_02)
   goals met: 4 of 4
